Revit 2027 API
FluidType.GetFluidType Method
 Gets a fluid type by name.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FluidType GetFluidType(
	Document document,
	string fluidTypeName
)
Public Shared Function GetFluidType (
	document As Document,
	fluidTypeName As String
) As FluidType
public:
static FluidType^ GetFluidType(
	Document^ document,
	String^ fluidTypeName
)
static member GetFluidType :
        document : Document *
        fluidTypeName : string -> FluidType
Parameters
document Document
 The document.
fluidTypeName String
 The name of fluid type.
Return Value
FluidType
 The fluid type. null if the fluid type was not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace